{"data":{"site":{"siteMetadata":{"title":"AB to XY"}},"markdownRemark":{"id":"f2a92947-fd55-5f6d-a4b6-424654a845c6","excerpt":"“¡El pueblo te hará pedazos!” is what a typical Ganado would say if they heard the rumors and commentaries uttered by Resident Evil fans in…","html":"<img src=\"https://i.imgur.com/zIfcqAD.jpg\" title=\"Resident Evil 4\">\n<p>“¡El pueblo te hará pedazos!” is what a typical Ganado would say if they heard the rumors and commentaries uttered by Resident Evil fans in the mid-2000’s. Resident Evil 4 was a polarizing entry into the renowned survival-horror franchise, which effectively caused a schism within its fanbase. The game was very controversial concerning both its setting and its gameplay mechanics; you either loved it or hated it.</p>\n<p>For the longest time, it seems that there was no middle ground when it came to this game. However, as someone who grew up playing Resident Evil 3: Nemesis back in the mid 90’s, I was ecstatic to hear that a new RE game was in the works. Furthermore, since it had been more than five years after the previous installment, fans everywhere were dying for another game to get their Resident Evil fix. However, despite receiving universal praise from critics due to factors I will mention shortly, the game became infamous for changing the traditional Resident Evil formula, and heralding “the beginning of the end” for the franchise. And true enough; like Dead Space 3, Mass Effect Andromeda, or any other game that set their respective franchise on a downward spiral (at least, regarding popularity), Resident Evil 4 was regarded as the black sheep of the series.</p>\n<p>But was the game that bad? Did it ruin the legacy of its predecessors, or did it improve some features, and fleshed out others? Are the comments warranted, or are they just being blown out of proportion by a fanbase that doesn’t quite know what it wants from their beloved series? I asked myself all these questions and set out to revisit the game that, alongside Silent Hill, was my go-to title for when I wanted to crap my pants. And what better time to visit a horror game than in Halloween month, right?</p>\n<p>So without further ado, let’s get this review started!</p>\n<h1>What is it?</h1>\n<p>Resident Evil 4 is a survival-horror game in which you take control of Leon S. Kennedy, a federal agent and professional zombie exterminator, who is on a mission to save the President’s daughter, Ashley. An unidentified group of people had kidnapped her and were holding her hostage somewhere overseas. Leon’s investigation takes him to an unnamed European country—which I assume is Spain since the natives speak Spanish. Specifically, the adventure starts in a remote village that can only be reached through a maze of dirt roads that are ominously-lined with dead trees. Luckily for Leon, he managed to befriend a couple of local officers and secured a trip to the village where Ashley was last seen, much to the bemusement of his entourage who insisted that the “American” was severely unprepared for the task at hand.</p>\n<p>This beginning strikes the perfect balance between suspense and thrill, as the intro continually sets up the occasions for something to go wrong, yet it never does. Furthermore, the group’s way of casually chatting as they make their way to the village creates a dissonance that made me feel uneasy; I didn’t know whether to feel afraid or amused at the goofy Spanish accents. This event marked the first time a Resident Evil game tried to set up a proper plot, instead of throwing you straight into the action. Heck, Resident Evil 3: Nemesis, immediately began with Jill Valentine, the protagonist, surrounded by a group of zombies that the player had to fend off.</p>\n<img src=\"https://i.imgur.com/QavrwWB.jpg\" title=\"Chat with Hunnigan\">\n<p>Nevertheless, the game abandons all pretenses of subtlety right after they give you control of Leon, as things quickly turn south for our hero when he tries asking one of the locals as to the whereabouts of Ashley. After telling Leon the equivalent of GTFO in Spanish, the man turns around, picks up an axe, and tries to chop Leon’s head off. This moment marks the first time in the next 10 to 15 hours of game time that you’ll have to shoot and cut your way through hordes of zombies (or Ganados, as they’re called here) to rescue the President’s daughter and bring her safely back home.</p>\n<h1>The Gameplay</h1>\n<p>Before hopping into the good and bad parts of this game, I feel the need to talk about the game’s controls scheme and general gameplay, since this is one of the factors that significantly contribute towards the fanbase schism.</p>\n<p>In past iterations, Resident Evil used a control scheme that fans named “tank controls.” This term originated because, regardless of the direction that your character was facing, pressing up on the D-pad would make him or her move forward, much like a tank that needed to spin around before advancing towards its destination. In this sense, players could not strafe nor sidestep and had to turn slowly before moving forward, which made dodging or executing complex maneuvers an absolute nightmare. Nevertheless, these games balanced the clunky movements by giving the player more than enough tools to keep the enemies at bay without having to rely on the controls; as long as you played your cards right, you wouldn’t have to move that much and could dispatch enemies from a distance.</p>\n<img src=\"https://i.imgur.com/gjyqOTl.jpg\" title=\"TPS Action\">\n<p>Resident Evil 4 modified the traditional gameplay to an over-the-shoulder camera, akin to a third-person shooter. In this sense, instead of pressing a button to auto-aim and then blasting your foes away, you had to press a button to draw your weapon, and then use the analog sticks to carefully place your shots on the enemies’ vital spots using Leon’s targeting laser. This change made the game feel more action-oriented, which didn’t appeal to numerous fans that claimed their favorite horror series was now more action than horror.</p>\n<p>And in reality, they were right.</p>\n<p>This game featured more action than there ever had been in a Resident Evil game up to that point. Nevertheless, all the other elements such as ammunition and healing item management, puzzles, traversing through sprawling environments, and even the sheer body horror that was present in all the different iterations were there. Nevertheless, whether this gameplay change was a good or bad move by Capcom is, and always will be, in the eye of the beholder.</p>\n<p>Myself? I actually like what they did, mostly because the developers had more hardware to tinker with. In this sense, instead of adopting tank controls due to the limitations of the respective platforms, they adapted the traditional control scheme to an over-the-shoulder, action-oriented perspective as a stylistic choice, which brings us to our next point: pre-rendered backgrounds.</p>\n<h1>The Environments</h1>\n<p>The other factor that contributed to the player base schism is the removal of pre-rendered backgrounds in favor of 3D-environments. Due to the limitations of consoles back in the Playstation and Nintendo 64 generation, developers relied on still images to serve as the backdrops of all the areas in their games. The usage of this technique meant that the only elements that they had to model were the characters and enemies.</p>\n<p>While rudimentary, this was an ingenious solution to a problem that, otherwise, would’ve been impossible to address. By designing and drawing still images as the backdrops for all the action, they could lower the performance impact that 3D-rendered environments would have on their respective consoles. Furthermore, they could create a visual appeal that no other games would have. Before long, this design aesthetic quickly became the “Capcom look” back in the early 2000’s, which was present in most of their games at the time. In a sense, if you would blindly buy a Capcom game back then, and it happened to have pre-rendered backgrounds, then you immediately knew that you were in for a good time.</p>\n<img src=\"https://i.imgur.com/wcwEH72.jpg\" title=\"Salazar&apos;s Tower\">\n<p>Resident Evil 4 did away with all of these still images, and instead created full 3D environments for all their areas. While the change was noticeable, they didn’t look bad at all, nor did they in any way detract from my overall experience of playing through the game. If anything, they allowed the developers to take their horror elements in a new direction through the removal of fixed camera angles that were a necessity back when pre-rendered backgrounds still existed.</p>\n<p>Once again, the perception of this change as good or bad is up for discussion.</p>\n<img src=\"https://i.imgur.com/OoWRBCK.jpg\" title=\"The Island\">\n<p>While I miss the appeal of old-school pre-rendered backgrounds, I thoroughly enjoyed playing through Resident Evil 4 once again and adventuring through the many environments which, since it had been a long time since I last visited them, I had all but forgotten about.</p>\n<h1>The Good</h1>\n<p>Now that we got what I believe to be the most critical aspects of this game out of the way, let’s talk about the things that make it so great.</p>\n<h3>The weapon variety</h3>\n<p>Resident Evil 4 has an insane amount of weapons available for use. Well, at least for Resident Evil standards.</p>\n<img src=\"https://i.imgur.com/7q25Gx8.jpg\" title=\"Merchant&apos;s Wares\">\n<p>While you start the game with the standard 9mm pistol, you can quickly increase your repertoire either by picking up new weapons or buying them directly from the merchant. In the first few minutes of the game, you can bolster your arsenal with a pump-action shotgun that you can pick up to fend off the mob of Ganados trying to eat your face. Furthermore, once you advance a bit more, you can purchase a bolt-action rifle, and a TMP (which is like a UZI), from the merchant.</p>\n<img src=\"https://i.imgur.com/uOMR5oA.jpg\" title=\"Happy Merchant\">\n<p>Of course, in true Resident Evil fashion, the only thing preventing you from becoming a living, walking arsenal is your inventory space or lack thereof. Like other games, you have to continually manage your inventory space to make room for healing items, weapons, grenades, and ammunition, as even your bullets take up precious space. Fortunately, you can expand your inventory significantly throughout the game by purchasing Attache Cases from the merchant. I can imagine Leon running around a zombie-infested castle lugging around a massive case with rocket launchers, rifles, and other warfare paraphernalia; priceless.</p>\n<h3>The survival gameplay</h3>\n<p>And speaking of inventory management, you’ll never get more than enough ammo in this game. Resident Evil 4 brings back survival horror gameplay by severely limiting ammo acquisition throughout the entire game. Because of this, you have to refine your aim to target the enemies’ weak spots and take them down with as few bullets as possible. In some cases, you might even need to use your knife to finish off downed foes and save some bullets for other occasions.</p>\n<img src=\"https://i.imgur.com/3XSBiAI.jpg\" title=\"Inventory Management\">\n<p>In my experience, I was continually going for headshots (except for when the Plagas started appearing; I always panic against those writhing monstrosities), and finishing enemies with the knife, and I still had ammo issues near the end of the game.</p>\n<p>I used my rifle, which was my most potent weapon by far, during the last quarter of the game, and burned all the ammo I had for it. Similarly, my stock of shotgun shells was running on fumes by the time I reached the final boss. The weapon that I had most ammo for was always the Red 9, which took 9 mm bullets since the endgame enemies were far too tanky for me to kill with a gun of that caliber. I chose to use my rifle to dispatch the strongest enemies since I could do so in 2 or 3 bullets, instead of having to use 20 or 30 9 mm bullets. The TMP, which I began using in the second half of the game, was a godsend since it could hold around 250 rounds per magazine. While its damage was low, its shots would still send enemies into their stagger animation, after which I could knock them down with a swift kick, and finish them off with my knife.</p>\n<p>In short, I had to use more than just my bullets to get through this game. I had to use my wits, cunning, and creativity to eliminate each foe while also conserving ammo for the bosses as well as for the strongest enemies.</p>\n<h3>Just the right amount of horror</h3>\n<p>While this game did away with the slow combat of past entries and shifted towards a more action-oriented style of play, it did not let us down when it came down to the horror nitty-gritty.</p>\n<p>Fair warning: I’ve never considered Resident Evil to be a “horror” franchise; jump scares—which were the games’ main form of making you poop your pants—are cheap in my book and not horror elements. With that being said, this game was spot-on when it came to creating a hostile atmosphere where you’re almost afraid to walk forward out of fear of what may happen.</p>\n<p>This is especially true when you arrive at the island and have to deal with the eerie Regenerators, humanoid enemies that are about a head taller than Leon (who is already a pretty tall guy), and that move slowly towards you, their body twitching uncontrollably. However, the main spook factor of these gray fellas is their heavy breathing; you can hear these guys from a mile away due to their raspy, labored, horrific breathing, which complements their awful looks. Furthermore, while they’re fragile as heck (you can blow off a limb with a single shot from your shotgun), they can’t die unless you target the parasites residing inside their body, which fuel their regenerative capabilities. In this sense, even if you blow off their legs, they can still jump at you like a fish out of water and latch onto your neck with their gaping maws.</p>\n<img src=\"https://i.imgur.com/dZXfHco.jpg\" title=\"Regenerator\">\n<p>Dealing with Regenerators is just an all-around awful experience, especially when you have to fight against their enhanced brethren, the Iron Maidens. These foes not only share the same regenerative capabilities of their cousins, but they also have sharp spikes all over their body, not unlike those of a sea urchin. Besides walking at you menacingly, the Iron Maidens can blow out their spikes to attack anything that comes within reach.</p>\n<p>Everything is horrible when it comes to these foes.</p>\n<img src=\"https://i.imgur.com/RNF8kUX.jpg\" title=\"Body Horror at it&apos;s finest\">\n<p>Another notable aspect of Resident Evil is its body horror. It has ample instances of disfigurements, heads exploding and giving way to monstrosities riddled with spikes and tentacles, and all-around gore. If there ever was a game in need of the iconic Capcom “explicit violence and gore” disclaimer, it’s this one.</p>\n<h1>The Bad</h1>\n<p>For all the good that this game has to offer, some aspects are outright shameful, even by the standards of the time.</p>\n<h3>The QTEs</h3>\n<p>Unless you’re playing a game that revolves around them (Guitar Hero or Rock Band), no one likes QTEs.</p>\n<p>Short for QuickTime Events, a QTE is when a person has to input a specific set of buttons or commands or suffer the consequences, which are usually death or substantial loss of HP. Resident Evil 4 is riddled with these sequences, which is awful considering that the central core gameplay aspects of the game hardly suggest that you’ll encounter a QTE somewhere down the line.</p>\n<img src=\"https://i.imgur.com/pLhsjvk.jpg\" title=\"Unexpected QTEs\">\n<p>However, the game does an excellent job of introducing them by adding a couple of simple QTEs like running from a boulder by mashing a button and then pressing a combination of buttons to jump out of the path of the said rock. However, some of these events come from the furthest reaches of the left field and force you to quickly pick up the control (which you put down because you were viewing the cutscene) to input the commands or risk death.</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/hLICfBk_xh0?rel=0&amp;controls=0&amp;showinfo=0\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p>The most grievous instances of these events happen during the cutscene preceding the fight against Krauser, one of Leon’s old buddies turned soulless zombie henchman. In these parts, you have to input a string of commands in sequence to avoid getting stabbed by Krauser, while delivering several cuts of your own. The cutscene itself is fantastic, with the fight choreography expertly designed and perfectly animated to great effect; not that you’d know since you’re too busy inputting commands like a chump.</p>\n<h3>The laughably bad voice acting</h3>\n<p>Except for Leon and a couple of side characters, the voice acting in this game is terrible, even for Resident Evil standards (RE2, anyone?). This is both one of the best and worst aspects of the game as the voice acting of the Ganados border on laughable, and listening to them is always fun times. Every time a villager screams at me in horribly broken Spanish, I can’t help but giggle, which takes away from the tense atmosphere that the game tries to create. What’s more, the villagers seem to have a difficult time deciding on whether if they want to be Mexican or Spanish as they sometimes announce colloquialisms of both cultures.</p>\n<p>Fortunately, this issue is confined mostly to the loud villagers, as they are the ones that have the majority of lines in broken Spanish. Unfortunately, these enemies are present in three-quarters of the game, which means that you’ll be listening to their poor excuse for diction for around 15 hours.</p>\n<h1>Recommended For</h1>\n<p>Fans of survival-horror games, of course!</p>\n<p>While Resident Evil 4 had some shortcomings and was the one that jump-started the series’ transition into more action-oriented playstyles, it’s still a solid survival horror game. In this game, you’ll be managing your ammo and healing items, solving puzzles, and lining up accurate shots throughout your entire playthrough of 20-ish hours. Furthermore, once you complete the game, you’ll unlock several different game modes, including the popular Mercenaries mode where you have to complete objectives to earn points, which can then be traded in for several outfits, and items for use in subsequent playthroughs.</p>\n<h1>Not Recommended For</h1>\n<p>Like most survival-horror games that combine action and horror, Resident Evil 4 falls a bit flat when you consider both of these aspects individually. If you’re looking for a true spookfest, then you’re better off playing something else like Outlast, Amnesia, or even other survival-horror games with a more oppressive atmosphere, like Silent Hill.</p>","frontmatter":{"title":"Resident Evil 4: Was It Truly The Black Sheep of the Franchise?","date":"October 31, 2018"}}},"pageContext":{"slug":"/resident-evil-4/","previous":{"fields":{"slug":"/opus-magnum-pc/"},"frontmatter":{"title":"Opus Magnum: How Video Games Break Barriers and Crush Comfort Zones"}},"next":null}}